
public class ch15 {
  public static void main(String[] args) {
    int a, b = 10;
    a = 20 % 11 / 3 * 5 - b;
    // a = 20 % 11 / 3 * 5 - 10
    // a = 9 / 3 * 5 - 10
    // a = 3 * 5 - 10
    // a = 15 - 10
    // a = 5
    /**
     * 연산자 순서
     * 단산시관비논조대순
     * 단항 (!, ~, ++, --, sizeof)
     * 산술 (*, /, %, +, -)
     * 시프트 (<<, >>)
     * 관계 (<, <=, >=, >, ==, !=)
     * 비트 (&, ^, |)
     * 논리 (&&, ||)
     * 조건 (?, :)
     * 대입 (=, +=, -=, *=, /=, %=, <<=, >>=)
     * 순서 (.)
     */

    System.out.printf("%d\n", a);
  }

}
